Tekla Open API Reference for Tekla Structures 2025
WpfMaterialCatalog Class
 The WpfMaterialCatalog class represents a group of controls to select materials using the material catalog.
 WpfMaterialCatalog
Inheritance Hierarchy
System.Object
 System.Windows.Threading.DispatcherObject
 System.Windows.DependencyObject
 System.Windows.Media.Visual
 System.Windows.UIElement
 System.Windows.FrameworkElement
 System.Windows.Controls.Control
 System.Windows.Controls.ContentControl
 System.Windows.Controls.UserControl
 Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class WpfMaterialCatalog : UserControl,
	IComponentConnector
Public Class WpfMaterialCatalog
	Inherits UserControl
	Implements IComponentConnector
The WpfMaterialCatalog type exposes the following members.
Constructors
Name | Description
WpfMaterialCatalog()
 Initiates a new instance of the control.
WpfMaterialCatalog(String)
 Creates a new instance of the MaterialCatalog and will select the material (if available) in the tree.
Top
Properties
Name | Description
ButtonHeight
 Gets and sets the height of the button control.
ButtonText
 Gets and sets the text of the button control.
ButtonWidth
 Gets and sets the width of the button control.
SelectedMaterial
 Gets the selected material in the control.
Top
Methods
Name | Description
InitializeComponent
 InitializeComponent
Top
Events
Name | Description
SelectClicked
 The SelectClicked event is raised when the Select button is clicked.
SelectionDone
 The SelectionDone event is raised when the selection has been done.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace